DNS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices 
(
	(27.5 5.0 0.0)
	(-10.0 5.0 0.0)
	(-10.0 -5.0 0.0)
	(27.5 -5.0 0.0)
	(27.5 5.0 16.0)
	(-10.0 5.0 16.0)
	(-10.0 -5.0 16.0)
	(27.5 -5.0 16.0)

);

blocks (
hex (2 3 0 1 6 7 4 5) (500 135 200) simpleGrading (1 1 1)
);

edges
(
);

patches 
(
	patch inlet_gas
	(
	(1 2 6 5)
	)

	patch inlet_liquid
	(
	(0 1 2 3)
	)

	patch outlet
	(
	(0 4 7 3)
	)
	
	patch atmosphere
	(
	(4 5 6 7)
	(0 4 5 1)
	(2 3 7 6)
	)
	 
);

mergePatchPairs
(
);

// ************************************************************************* //
